'''● Ваша задача
Написать программу на любом языке в любой парадигме для
бинарного поиска. На вход подаётся целочисленный массив и
число. На выходе - индекс элемента или -1, в случае если искомого
элемента нет в массиве.
'''

def binary_search(list, target):
    low = 0  # индекс нижней границы поиска
    high = len(list) - 1  # индекс верхней границы поиска
    while high >= low:  # пока промежуток поиска не равен одному элементу
        middle = int((low + high) / 2) # берем средний элемент и сравниваем его с искомым
        if target < list[middle]: # если он меньше
            high = middle - 1 # верхний элемент смещаем на средний -1
        if target > list[middle]: # если он больше
            low = middle + 1 # нижний элемент смещаем на средний + 1
        if target == list[middle]: # если они ура равны
            return middle # вернули индекс искомого элемента

    return -1 # если элемента в списке нет, вернем -1


mylist = [1,2,5,8,9,11,15,17]
target = 5
target1 = 6
print(binary_search(mylist, target))
print(binary_search(mylist, target1))