

# Написать скрипт в любой парадигме, который выводит на экран таблицу умножения всех чисел от 1 до n.
# Обоснуйте выбор парадигм.
#  Пример вывода:
# 1 * 1 = 1
# 1 * 2 = 2
# 1 * 3 = 3
# 1 * 4 = 4
# 1 * 5 = 5
# 1 * 6 = 6
# ..
# 1 * 9 = 9

# не ясно условие задачи. Всех чисел от 1 до N на что? В примере вывода число умножается на единицу

def multipl_one_to_n(n):                           # решение как в описании вывода
    for i in range (1, n + 1):                     # каждое число до n
        print(f' 1 * {i} = {1*i}')                 # умножается на единицу

def multipl_to_n(n):                               # таблица умножения всех чисел от 1 до n
    for i in range (1, n+1):                       # первый множитель задается в условии
        for j in range(1, 11):                     # второй множитель от 1 до 10 (как в таблице умножения)
            print(f'{i} * {j} = {j*i}')
        print("")


print('таблица умножения на 1')

y = 9
multipl_one_to_n(y)

print('таблица умножения')

x = 6
multipl_to_n(x)
